In [2]:
import pandas as pd

## Ques 1 Make a Pandas DataFrame with two-dimensional list

In [5]:
# Creating a list with 2-dimension

list1 = [['John',36,40,29],
        ['Mic',49,30,29],
        ['Rick',48,47,1],
        ['Rock',43,45,46]]

## Here one list presents one row..



#Creating a Dataframe
DataFrame = pd.DataFrame(list1, columns=['Name','BigData','DataScience','MathematicalModelling'])
DataFrame

   Name  BigData  DataScience  MathematicalModelling
0  John       36           40                     29
1   Mic       49           30                     29
2  Rick       48           47                      1
3  Rock       43           45                     46

### Ques 2 Creating DataFrame from dict of narray/lists

In [8]:
## Creating a dictionary

dict1 = {'Name':['John','Mic','Rick','Rock'],
        'BigData':[36,49,48,43],
        'DataScience':[40,30,47,45],
        'MathematicalModelling':[29,29,1,46]}

## Here one key-value is associated with one column..

#Creating a DataFrame
DataFrame= pd.DataFrame(dict1)
DataFrame

   Name  BigData  DataScience  MathematicalModelling
0  John       36           40                     29
1   Mic       49           30                     29
2  Rick       48           47                      1
3  Rock       43           45                     46

### Ques 3 Create a Pandas DataFrame from List of Dicts

In [11]:
# Creating a list of Dicts

dict2 = [{'Name':'John','BigData':36,'DataScience':40,'MathematicalModelling':29},
        {'Name':'Mic','BigData':49,'DataScience':30,'MathematicalModelling':29},
        {'Name':'Rick','BigData':48,'DataScience':47,'MathematicalModelling':1},
        {'Name':'Rock','BigData':43,'DataScience':45,'MathematicalModelling':46}]

## Here we have key as the column name and values as the row.
DataFrame = pd.DataFrame(dict2)
DataFrame

   Name  BigData  DataScience  MathematicalModelling
0  John       36           40                     29
1   Mic       49           30                     29
2  Rick       48           47                      1
3  Rock       43           45                     46